jmeter/aggregate.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
Register User,1400,879,711,870,1115,6615,536,12796,7.143%,.18874,0.09,0.05
Login User,1400,282,273,352,406,1036,165,1994,35.714%,.18874,0.08,0.05
Get User Interests,1400,149,189,218,234,403,0,2939,85.714%,.18874,0.20,0.04
Post User Interests,1400,146,191,219,231,328,0,699,92.857%,.18873,0.10,0.04
Get Blog Posts,1400,210,197,228,251,429,164,3038,0.000%,.18873,0.05,0.03
Get Category,1400,207,196,227,248,429,164,2987,0.000%,.18873,0.27,0.04
TOTAL,8400,312,204,702,750,1121,0,12796,36.905%,1.13194,0.78,0.24