jmeter/summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
Register User,1400,879,536,12796,1003.34,7.143%,.18874,0.09,0.05,476.1
Login User,1400,282,165,1994,135.72,35.714%,.18874,0.08,0.05,416.4
Get User Interests,1400,149,0,2939,128.01,85.714%,.18874,0.20,0.04,1075.9
Post User Interests,1400,146,0,699,97.70,92.857%,.18873,0.10,0.04,555.4
Get Blog Posts,1400,210,164,3038,117.45,0.000%,.18873,0.05,0.03,252.0
Get Category,1400,207,164,2987,88.10,0.000%,.18873,0.27,0.04,1440.0
TOTAL,8400,312,0,12796,495.03,36.905%,1.13194,0.78,0.24,702.6